In [7]:
import pandas as pd

In [8]:
# Load raw data
df = pd.read_csv(r"C:\Users\oytun\Downloads\Berlin_pop_stats - Districts Residents by Religion other or none.csv")

In [9]:
df.head()

                neighbourhood   total  Germans  Foreigners
0                       Mitte  333248   195765      137483
1    Friedrichshain-Kreuzberg  251355   166405       84950
2                      Pankow  363021   284308       78713
3  Charlottenburg-Wilmersdorf  263824   179061       84763
4                     Spandau  198091   135550       62541

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   neighbourhood  13 non-null     object
 1   total          13 non-null     int64
 2   Germans        13 non-null     int64
 3   Foreigners     13 non-null     int64
dtypes: int64(3), object(1)
memory usage: 548.0+ bytes

In [11]:
df.isnull().sum()

neighbourhood    0
total            0
Germans          0
Foreigners       0
dtype: int64

In [12]:
df.columns

Index(['neighbourhood', 'total', 'Germans', 'Foreigners'], dtype='object')

In [13]:
df.columns = df.columns.str.lower()

In [14]:
# Standardize the 'neighbourhood' names by replacing abbreviated or inconsistent names
# with their full, lowercase standardized versions for uniformity across the dataset.
df['neighbourhood'] = df['neighbourhood'].replace({
    'Friedrichshain-Kreuzberg': 'friedrichshainkreuzberg',
    'Charlottenburg-Wilmersdorf': 'charlottenburgwilmersdorf',
    'Tempelhof-Schöneberg': 'tempelhofschöneberg',
    'Steglitz-Zehlendorf': 'steglitzzehlendorf',
    'Marzahn-Hellersdorf': 'marzahnhellersdorf',
    'Treptow-Köpenick': 'treptowköpenick',
    'Neukölln': 'neukölln',
    'Pankow': 'pankow',
    'Lichtenberg': 'lichtenberg',
    'Reinickendorf': 'reinickendorf',
    'Mitte': 'mitte',
    'Spandau': 'spandau',
    'Berlin': 'berlin'
})

In [17]:
df.dtypes

neighbourhood    object
total             int64
germans           int64
foreigners        int64
dtype: object

In [15]:
df

                neighbourhood    total  germans  foreigners
0                       mitte   333248   195765      137483
1     friedrichshainkreuzberg   251355   166405       84950
2                      pankow   363021   284308       78713
3   charlottenburgwilmersdorf   263824   179061       84763
4                     spandau   198091   135550       62541
5          steglitzzehlendorf   216895   168085       48810
6         tempelhofschöneberg   271340   195713       75627
7                    neukölln   266828   179764       87064
8             treptowköpenick   261973   214232       47741
9          marzahnhellersdorf   267319   213295       54024
10                lichtenberg   285666   210577       75089
11              reinickendorf   205821   146081       59740
12                     berlin  3185381  2288836      896545

In [18]:
df.describe()

              total       germans     foreigners
count  1.300000e+01  1.300000e+01      13.000000
mean   4.900586e+05  3.521286e+05  137930.000000
std    8.111406e+05  5.831000e+05  229123.149354
min    1.980910e+05  1.355500e+05   47741.000000
25%    2.513550e+05  1.680850e+05   59740.000000
50%    2.668280e+05  1.957130e+05   75627.000000
75%    2.856660e+05  2.132950e+05   84950.000000
max    3.185381e+06  2.288836e+06  896545.000000

In [16]:
# Export the cleaned and transformed DataFrame to a CSV file
df.to_csv('districts_residents_by_religion_other_or_none.csv', index=False)